Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Glas mit eingebetteten dünnen elektrischen Leitern
en: Glass incorporating fine electrical conductors

source: Brenner für ätherische Öle
en: Essential oil burners

source: Untersetzer für Blumentöpfe
en: Saucers for flower pots

source: Flache Bratpfannen
en: Shallow pans for cooking

source: Schnellkochtöpfe [nicht elektrisch] für den Haushalt
en: Autoclaves (Non-electric -) for household use

source: Handbetätigte Flaschenöffner
en: Bottle openers [hand-operated]

source: Blumen- und Pflanzenhalter [Blumengestecke]
en: Holders for flowers and plants [flower arranging]

source: Poliermaterial [ausgenommen Poliermittel, -papier, -steine]
en: Polishing materials for making shiny, except preparations, paper and stone

source: Aschensiebe [Haushaltsartikel]
en: Cinder sifters [household utensils]

source: Trichter
en: Funnels

source: Nicht elektrische Teppichshampooniergeräte
en: Carpet shampoo applicators (Non-electric -)

source: Nicht elektrische Teppichkehrer
en: Carpet sweepers (Non-electric -)

source: Etuis für kosmetische Geräte
en: Cases adapted for cosmetic utensils

source: Angepasste Etuis an Körperpflegegeräte
en: Cases adapted for toilet utensils

source: Keramikartikel für die Küche
en: Ceramics for kitchen use

source: Wärmeschutzglas [teilweise bearbeitet]
en: Glass (Semi-worked -) adapted to absorb heat

source: Glas [teilweise bearbeitet] für Fahrzeuge
en: Glass (Semi-worked -) for vehicles

source: Transportkäfige für Haustiere
en: Cages for household pets

source: Nicht elektrische Fritteusen
en: Deep fryers, non-electric

source: Futterkästen für Vögel
en: Litter trays for birds

source: Nicht elektrische Eiertrenner für den Haushalt
en: Egg separators, non-electric, for household purposes

source: Leere Sprayflaschen
en: Empty spray bottles

source: Nicht elektrische Kaffeekocher
en: Coffeepots, non-electric

source: Wasserbehälter für lebende Fische
en: Water tanks [for live fish]

source: Wärmeisolierte Haushaltsgefäße aus Glas
en: Heat insulated domestic vessels of glass

source: Nicht elektrische Mixgeräte für den Haushalt
en: Blenders, non-electric, for household purposes

source: Reinigungshandschuhe aus Stoff
en: Cleaning mitts of fabric

source: Mopp-Eimer
en: Mop pails

source: Flakons
en: Flasks

source: Bemalte Glaswaren
en: Painted glassware

source: Glas mit eingebetteten elektrischen Leitern
en: Glass incorporating electrical conductors

source: Reiben [nicht elektrische Haushaltsartikel]
en: Graters [non-electric household utensils]

source: Kaffeemühlen
en: Coffee grinders

source: Blumenschalen aus Glas
en: Jardinieres of glass

source: Glas, roh oder teilweise bearbeitet, ausgenommen Bauglas
en: Glass, unworked or semi-worked, except building glass

source: Platten gegen das Überkochen von Milch
en: Plates to prevent milk boiling over

source: Nicht elektrische Abstaubgeräte
en: Dusting apparatus, non-electric

source: Aquarien
en: Aquariums

source: Striegel
en: Currycombs

source: Sprühstäbe für Gartenschläuche
en: Sprayer wands for garden hoses

source: Schaber zum Reinigen von Behältern
en: Brushes for cleaning tanks and containers

source: Glasfasern, ausgenommen für Isolier- und Textilzwecke
en: Fibreglass, other than for insulation or textile use

source: Pappbecher
en: Paper cups

source: Übertöpfe aus Keramik
en: Planters of earthenware

source: Nicht elektrische Insektenfallen
en: Traps (Non-electric -) for insects

source: Mehrweg-Wasserflaschen aus Kunststoff ohne Inhalt
en: Reusable plastic water bottles sold empty

source: Kunstgegenstände aus Porzellan, Keramik, Steingut oder Glas
en: Works of art of porcelain, ceramic, earthenware or glass

source: Backbleche aus Aluminium
en: Baking trays made of aluminium

source: Bürsten für die Pferdepflege
en: Brushes for grooming horses

source: Kunststoffschalen als Streukästen für Katzen
en: Plastics trays for use as litter trays for cats

source: Poröses Glas
en: Porous glass

source: Nicht elektrische Schneebesen für den Haushalt
en: Whisks, non-electric, for household purposes

source: Spieße [Kochutensilien]
en: Skewers (cooking utensil)

source: Scheuerschwämme für die Küchenreinigung
en: Abrasive sponges for kitchen [cleaning] use

source: Dosen aus Feinporzellan
en: Animal bristles [brushware]

source: Tierborsten [Bürsten- und Pinselwaren]
en: Napkin holders of precious metal

source: Gartenzwerge aus Steingut
en: Garden gnomes of earthenware

source: Flaschen für Pharmazeutika ohne Inhalt
en: Bottles for pharmaceuticals sold empty

source: Kastenförmige Spender für Papierservietten
en: Boxes for dispensing paper serviettes

source: Beschichtetes Flachglas [nicht für Bauzwecke]
en: Laminated flat glass [not for building]

source: Proviantdosen aus Kunststoff
en: Lunch boxes made of plastic

source: Fusselfreie Reinigungstücher
en: Lintless cleaning cloths

source: Abfallschaufeln für die Haltung von Haustieren
en: Litter scoops for use with pet animals

source: Stahlwatte für Reinigungszwecke
en: Metallic wool for cleaning purposes

source: Milchkannen
en: Milk churns

source: Leere Tropfer für kosmetische Zwecke
en: Droppers sold empty for cosmetic purposes

source: Flaschenkühler [Gefäße]
en: Bottle coolers [receptacles]

source: Handbetätigte Salatschleudern
en: Salad drainers (Hand-operated -)

source: Bodenwischtücher [Putztücher]
en: Cloth for washing floors

source: Wasserspritzen zum Besprühen von Pflanzen
en: Water syringes for spraying plants

source: Mixbecher [Shaker]
en: Cocktail shakers

source: Vom Tier betätigbare Futterspender
en: Animal activated animal feeders

source: Pferdebürsten aus Draht
en: Horse brushes of wire

source: Spieße für Kochzwecke
en: Skewers for use in cooking

source: Bratpfannen [nicht elektrisch]
en: Skillets (Non-electric -)

source: Scheuerkissen für die Küche
en: Abrasive pads for kitchen purposes

source: Scheibenglas [nicht für Bauzwecke]
en: Common sheet glass [not for building]

source: Plastik-Wasserflaschen [leer]
en: Plastic water bottles [empty]

source: Transportable Getränkespender
en: Portable beverage dispensers

source: Blumentöpfe
en: Flower pots

source: Zerstäuber für Haushaltszwecke
en: Nebulizers for household use

source: Teetassen
en: Tea cups

source: Fleischklopfer für Haushaltszwecke
en: Meat tenderisers for household purposes

source: Tabletts
en: Meal trays

source: Futternäpfe für Haustiere
en: Food containers for pet animals

source: Isoliergefäße für Nahrungsmittel
en: Thermally insulated containers for food

source: Schwämme zum Auftragen von Körperpuder
en: Sponges for applying body powder

source: Reinigungstücher für optische Linsen
en: Cloths for wiping optical lenses

source: Glashalter für das Bad
en: Bathroom glass holder

source: Bürsten für Billardtische
en: Billiard table brushes

source: Spender für Frischhaltefolie [ausgenommen ortsfeste]
en: Dispensers for cling film [other than fixed]

source: Doppelwandige Isolierbehälter für Nahrungsmittel
en: Double heat insulated containers for food

source: Zimmerterrarien [für Pflanzenkulturen]
en: Indoor terrariums [plant cultivation]

source: Chamoisleder für Reinigungszwecke
en: Chamois leather for cleaning

source: Baumwollabfälle für Putzzwecke
en: Cotton waste for cleaning

source: Obstschalen aus Glas
en: Fruit bowls of glass

source: Profilglas [Halbfabrikate]
en: Profiled glass [semi-finished]

source: Vasen
en: Vases

source: Mehrweg-Wasserflaschen aus Edelstahl ohne Inhalt
en: Reusable stainless steel water bottles sold empty

source: Aerosolzerstäuber, nicht für medizinische Zwecke
en: Aerosol dispensers, not for medical purposes

source: Topfreiniger für Kochtöpfe
en: Scourers for saucepans

source: Mundduschen, ausgenommen für zahnmedizinische Zwecke
en: Oral irrigators, other than for use in dentistry

source: Schaber für Haushaltszwecke
en: Scrapers for household purposes

source: Hartglas [nicht für Bauzwecke]
en: Tempered glass [not for building]

source: Backschüsseln aus Steingut
en: Baking dishes made of earthenware

source: Backbleche aus unedlem Metall
en: Baking sheets of common metal

source: Bürsten für die Körperpflege
en: Brushes for personal hygiene

source: Unbearbeitetes Spiegelglas
en: Plate glass being unworked

source: Rauchverzehrer für den Haushalt
en: Smoke absorbers for household purposes

source: Kunststoffdeckel für Pflanztöpfe
en: Plastic lids for plant pots

source: Antistatische Tücher für Haushaltszwecke
en: Anti-static cloths for household use

source: Potpourri-Gefäße
en: Pot pourri jars

source: Senftöpfe
en: Mustard pots

source: Nicht elektrische Kaffeemühlen
en: Non-electrical coffee grinders

source: Zuckerdosen, nicht aus Edelmetall
en: Sugar bowls [not of precious metal]

source: Gartenzwerge aus Glas
en: Garden gnomes of glass

source: Elektrische Zahnbürsten
en: Toothbrushes, electric

source: Gießkannen
en: Watering cans

source: Leuchtglas [nicht für Bauzwecke]
en: Luminous glass [not for building]

source: Fusselroller mit Klebefunktion zur Fusselentfernung von Kleidung
en: Lint rollers [adhesive] for removing lint from clothing

source: Schüsseln aus Kunststoff
en: Plastic bowls [basins]

source: Messerbänke für den Tisch
en: Knife rests for the table

source: Nicht elektrische Waffeleisen
en: Waffle irons, non-electric

source: Schalen für Pflanzen
en: Bowls for plants

source: Sakrale Gefäße
en: Sacred vessels

source: Behälter für Weihwasser, nicht aus Metall
en: Containers (Non-metallic -) for holy water

source: Behälter für Vogelfutter
en: Containers for bird food

source: Gefäße für Potpourri
en: Containers for pot pourri

source: Haushaltshandschuhe für Reinigungszwecke
en: Household gloves for cleaning purposes

source: Applikationsstäbchen zum Auftragen von Make-up
en: Applicator sticks for applying makeup

source: Flaschen
en: Bottles

source: Schmortöpfe [nicht elektrisch]
en: Slow cookers (Non-electric -)

source: Tragbare Babybadewannen
en: Baby baths, portable

source: Farbiges Scheibenglas [nicht für Bauzwecke]
en: Colored sheet glass [not for building]

source: Abzieher für Geschirre
en: Squeegees for dishes

source: Geprägtes Glas
en: Stamped glass

source: Nicht elektrische Flaschenöffner
en: Non-electric bottle openers

source: Elektrische Insektenfallen
en: Traps (Electric -) for insects

source: Becher aus Keramikmaterial
en: Mugs made of ceramic materials

source: Nicht elektrische Mundduschen für den persönlichen Gebrauch
en: Periodontal irrigators [non-electric] for personal use

source: Bratspieße, nicht aus Metall
en: Cooking skewers, not of metal

source: Blumenschalen aus Steingut
en: Jardinieres of earthenware

source: Verbundglas [ausgenommen für Bauzwecke]
en: Laminated glass [other than for building]

source: Feuerfeste Schalen
en: Fireproof dishes

source: Waschbretter
en: Washing boards

source: Nicht elektrische Parkettbohnergeräte
en: Apparatus for wax-polishing, non-electric

source: Schaufeln für Haushaltszwecke
en: Scoops for household purposes

source: Butterdosen
en: Butter dishes

source: Toilettenpapierspender [ausgenommen ortsfeste]
en: Dispensers for the storage of toilet paper [other than fixed]

source: Einmachgläser aus Glas
en: Food preserving jars of glass

source: Puderdosen [Behälter]
en: Powder compacts [cases]

source: Kunststoffteller [Geschirr]
en: Plastic plates [dishes]

source: Backbleche
en: Baking tins

source: Eimer für gewerbliche Zwecke
en: Buckets for industrial use

source: Duftkugeln [Gefäße]
en: Pomanders [containers]

source: Bratspieße [ausgenommen Teile von Kochgeräten]
en: Spits [other than parts of cooking apparatus]

source: Glaswolle, ausgenommen zur Isolierung
en: Glass wool, other than for insulation

source: Nicht elektrische Polierapparate und -maschinen für Haushaltszwecke
en: Polishing apparatus and machines, for household purposes, non-electric

source: Parfümdiffusoren [leer]
en: Perfume sprayers [sold empty]

source: Reiskochtöpfe [nicht elektrisch]
en: Rice cooking pots [non-electric]

source: Serviettenspender für den Haushalt
en: Napkin dispensers for household use

source: Streukästen für Haustiere
en: Litter boxes for pets

source: Gartenzwerge aus Porzellan
en: Garden gnomes of porcelain

source: Becken [Behälter]
en: Basins [receptacles]

source: Küchengefäße [nicht aus Edelmetall]
en: Kitchen urns [not of precious metal]

source: Nicht elektrische Einmachtöpfe
en: Non-electric canners [pressure cookers]

source: Karaffen
en: Decanters

source: Keramikerzeugnisse für den Haushalt
en: Ceramics for household purposes

source: Abfallbehälter aus Metall
en: Litter baskets of metal

source: Gummihandschuhe für Haushaltszwecke
en: Rubber gloves for household use

source: Schaufeln zur Beseitigung von Tierexkrementen
en: Scoops for the disposal of animals excrement

source: Elektrische Kämme
en: Electric combs

source: Hitzeschutzglas [teilweise bearbeitet]
en: Heat protective glass (Semi-worked -)

source: Überzüge für Bügelbretter
en: Ironing board covers, shaped

source: Künstliche Nesteier
en: Nest eggs, artificial

source: Trichter für Fahrzeugöle
en: Automobile oil funnels

source: Elektrische und nicht elektrische Flaschenöffner
en: Bottle openers, electric and non-electric

source: Elektrische Bürsten [ausgenommen Maschinenteile]
en: Electric brushes, except parts of machines

source: Kaffeeservice [Tafelgeschirr]
en: Coffee services [tableware]

source: Zuckerdosen
en: Sugar bowls

source: Spiegelglas für Autos
en: Plate glass for cars

source: Poliertes Flachglas
en: Polished plate glass

source: Tragbare Getränkekühler
en: Portable beverage coolers

source: Fahrzeugmodelle [Ziergegenstände] aus Terrakotta
en: Model vehicles [ornaments] made of terra-cotta

source: Eierbecher
en: Egg cups

source: Mähnen-Bürsten [Pferdekämme]
en: Mane brushes [horse combs]

source: Figurinen aus Bleikristall
en: Carpet beaters [hand instruments]

source: Tabletts für den Haushalt
en: Fitted picnic baskets

source: Ausgestattete Picknickkoffer
en: Cooking skewers of metal

source: Dosen für den Haushalt aus Emaille
en: Flower vases of precious metal

source: Behälter zum Umtopfen von Pflanzen
en: Repotting containers for plants

source: Quarzglasfasern, nicht für Textilzwecke
en: Vitreous silica fibers [fibres], not for textile use

source: Bürsten für Pilze
en: Mushroom brushes

source: Elektrische Insektenanlock- und -vertilgungsgeräte
en: Electric devices for attracting and killing insects

source: Dekorationsmodelle aus Porzellan
en: Ornamental models made of porcelain

source: Kleine Krüge
en: Small jugs

source: Körbe aus unedlem Metall für den Haushalt
en: Baskets of common metal for household use

source: Reinigungsbürsten für Schuhwaren
en: Brushes for cleaning footwear

source: Eimer für Haushaltszwecke
en: Buckets for household use

source: Gewürzmühlen [nicht elektrisch]
en: Spice grinders (Non-electric -)

source: Waschschüsseln, ausgenommen als Teile von sanitären Anlagen
en: Wash basins [bowls, not parts of sanitary installations]

source: Grillroste [Küchengeräte]
en: Grills [cooking utensils]

source: Gefäße für Haushalt oder Küche
en: Containers for household or kitchen use

source: Aluminiumformen [Küchenutensilien]
en: Aluminium moulds [kitchen utensils]

source: Tabletts für den Haushalt aus Papier
en: Trays of paper, for household purposes

source: Weingläser
en: Wine glasses

source: Bearbeitetes Scheibenglas [nicht für Bauzwecke]
en: Modified sheet glass [not for building]

source: Kunststoffbadewannen für Kinder
en: Plastic bathtubs for children

source: Spender für Spülmittel
en: Dispensers for detergents

source: Keksdosen
en: Cookie jars

source: Kochgeschirr [zum Reiskochen]
en: Mess-tins [rice cooking canteens]

source: Kochkessel
en: Cauldrons
